package org.yameida.worktool.service.weixin

///用到的一些常量数据
val workDayLists = listOf(
    "4-27",
    "9-28",
    "10-11"
)
val holidayLists = listOf(
    "1-28",
    "1-29",
    "1-30",
    "1-31",
    "2-3",
    "2-4",
    "4-5",
    "5-1",
    "5-2",
    "5-5",
    "6-2",
    "10-1",
    "10-2",
    "10-3",
    "10-6",
    "10-7",
    "10-8"
)

val homeAddressLists = listOf(
    MyAddress("104.066444", "30.769059", "中国四川省成都市新都区仁爱路152号欣茂·大峰景"),
    MyAddress("104.066354", "30.768835", "中国四川省成都市新都区仁爱路152号欣茂·大峰景"),
    MyAddress("104.066372", "30.768877", "中国四川省成都市新都区仁爱路152号欣茂·大峰景"),
    MyAddress("104.066273", "30.768763", "中国四川省成都市新都区仁爱路152号欣茂·大峰景"),
    MyAddress("104.066472", "30.769011", "中国四川省成都市新都区仁爱路152号欣茂·大峰景"),
    MyAddress("104.066462", "30.769016", "中国四川省成都市新都区仁爱路152号欣茂·大峰景"),
    MyAddress("104.066474", "30.769019", "中国四川省成都市新都区仁爱路152号欣茂·大峰景"),
    MyAddress("104.066452", "30.769021", "中国四川省成都市新都区仁爱路152号欣茂·大峰景"),
    MyAddress("104.066432", "30.769031", "中国四川省成都市新都区仁爱路152号欣茂·大峰景"),
    MyAddress("104.066444", "30.769059", "中国四川省成都市新都区赵家寺路235-239号欣茂·大峰景"),
    MyAddress("104.066364", "30.768758", "中国四川省成都市新都区赵家寺路157号欣茂·大峰景"),
    MyAddress("104.066711", "30.769061", "中国四川省成都市新都区赵家寺路441号欣茂·大峰景"),
    MyAddress("104.066516", "30.769005", "中国四川省成都市新都区仁爱路162号欣茂·大峰景"),


    MyAddress("104.067142", "30.769607", "中国四川省成都市新都区仁爱路239号开元国际社区"),
    MyAddress("104.065111", "30.771633", "中国四川省成都市新都区敬成路232号大丰(地铁站)"),
    MyAddress("104.067347", "30.769705", "中国四川省成都市新都区赵家寺路340号保利·春天花语"),
)

val workAddressLists = listOf(
    MyAddress("104.066444", "30.769059", "中国四川省成都市新都区仁爱路152号欣茂·大峰景"),
    MyAddress("104.066354", "30.768835", "中国四川省成都市新都区仁爱路152号欣茂·大峰景"),
    MyAddress("104.066372", "30.768877", "中国四川省成都市新都区仁爱路152号欣茂·大峰景"),
    MyAddress("104.066273", "30.768763", "中国四川省成都市新都区仁爱路152号欣茂·大峰景"),
    MyAddress("104.066472", "30.769011", "中国四川省成都市新都区仁爱路152号欣茂·大峰景"),
    MyAddress("104.066444", "30.769059", "中国四川省成都市新都区赵家寺路235-239号欣茂·大峰景"),
    MyAddress("104.066364", "30.768758", "中国四川省成都市新都区赵家寺路157号欣茂·大峰景"),
    MyAddress("104.066711", "30.769061", "中国四川省成都市新都区赵家寺路441号欣茂·大峰景"),
    MyAddress("104.066516", "30.769005", "中国四川省成都市新都区仁爱路162号欣茂·大峰景"),
)

data class MyAddress(
    val longitude: String,
    val latitude: String,
    val address: String
)